<?php


return [
    //1000---10000 是验证信息，不需要过 show 函数简析
    1005=>'手机号错误',
    1006=>'密码错误',
    1007=>'重复密码错误',
    1008=>'用户名错误',
    1009=>'验证码错误',
    1010=>'手机号码9-11位',
    1011=>'省会错误',
    1012=>'市错误',
    1013=>'县错误',
    1014=>'详细地址错误',
    1015=>'修改地址ID错误',

    ##################
    10000 =>'请求成功',
    10001 =>'请求失败',
    10002=>'token过期',
    10003=>'sign错误',
    10004=>'名称必填',
    10005=>'token错误',
    10010=>'用户不存在',
    10011=>'密码错误',
    10012=>'账号已存在',
    10013=>'请登录',
    10014=>'订单金额错误',
    10015=>'用户名称必填',
    10016=>'商品ID错误',
    10017=>'价格类型ID错误',
    10018=>'商品已下载',
    10019=>'设定的价格大于了商品价格',
    10020=>'购买数量错误',
    10021=>'购买数量错误',
    10022=>'订单号错误',
    10023=>'请先设置用户佣金比例',
    10024=>'数据格式错误',


    10050=>'请勿频繁操作',
    10051=>'用户配送距离不对',

];